# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireMaterialTypeSet..::..Erase Method
WireMaterialTypeSet Class See Also
---
Removes a specified wire material type from the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	WireMaterialType item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As WireMaterialType _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	WireMaterialType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..WireMaterialTypeThe wire material type to be erased.
# ### Return Value
The number of wire material types that were erased from the set.
# See Also
WireMaterialTypeSet Class
Autodesk.Revit.DB.Electrical Namespace